zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_ll_rcc.h
/**
  ******************************************************************************
  * @file    stm32mp1xx_ll_rcc.h
  * @author  MCD Application Team
  * @version $VERSION$
  * @date    $DATE$
  * @brief   Header file of RCC LL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP1xx_LL_RCC_H
#define STM32MP1xx_LL_RCC_H


#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp1xx.h"

/** @addtogroup STM32MP1xx_LL_Driver
  * @{
  */

#if defined(RCC)

/** @defgroup RCC_LL RCC
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @defgroup RCC_LL_Private_Variables RCC Private Variables
  * @{
  */

/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/
/** @defgroup RCC_LL_Private_Constants RCC Private Constants
  * @{
  */
/* Defines used to perform offsets*/

/* Clock source register offset Vs I2C46CKSELR register */
#define RCC_OFFSET_I2C46CKSELR     0x000UL
#define RCC_OFFSET_SPI6CKSELR      0x004UL
#define RCC_OFFSET_UART1CKSELR     0x008UL
#define RCC_OFFSET_RNG1CKSELR      0x00CUL
#define RCC_OFFSET_MCO1CFGR        0x740UL
#define RCC_OFFSET_MCO2CFGR        0x744UL
#define RCC_OFFSET_TIMG1PRER       0x768UL
#define RCC_OFFSET_TIMG2PRER       0x76CUL
#define RCC_OFFSET_I2C12CKSELR     0x800UL
#define RCC_OFFSET_I2C35CKSELR     0x804UL
#define RCC_OFFSET_SAI1CKSELR      0x808UL
#define RCC_OFFSET_SAI2CKSELR      0x80CUL
#define RCC_OFFSET_SAI3CKSELR      0x810UL
#define RCC_OFFSET_SAI4CKSELR      0x814UL
#define RCC_OFFSET_SPI2S1CKSELR    0x818UL
#define RCC_OFFSET_SPI2S23CKSELR   0x81CUL
#define RCC_OFFSET_SPI45CKSELR     0x820UL
#define RCC_OFFSET_UART6CKSELR     0x824UL
#define RCC_OFFSET_UART24CKSELR    0x828UL
#define RCC_OFFSET_UART35CKSELR    0x82CUL
#define RCC_OFFSET_UART78CKSELR    0x830UL
#define RCC_OFFSET_SDMMC12CKSELR   0x834UL
#define RCC_OFFSET_SDMMC3CKSELR    0x838UL
#define RCC_OFFSET_RNG2CKSELR      0x860UL
#define RCC_OFFSET_LPTIM45CKSELR   0x86CUL
#define RCC_OFFSET_LPTIM23CKSELR   0x870UL
#define RCC_OFFSET_LPTIM1CKSELR    0x874UL

#define CONFIG_SHIFT  0U
#define MASK_SHIFT    8U
#define REG_SHIFT     16U


/* Define all reset flags mask */
#define LL_RCC_MC_RSTSCLRR_ALL  0x000007FFU
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RCC_LL_Private_Macros RCC Private Macros
  * @{
  */

/* 32     28     24           16            8             0
   --------------------------------------------------------
   | Free  |     Register      |    Mask    | ClkSource   |
   |       |      Offset       |            | Config      |
   --------------------------------------------------------*/

#define LL_CLKSOURCE_MASK(__CLKSOURCE__) \
          (((__CLKSOURCE__) >> MASK_SHIFT  ) & 0xFFUL)

#define LL_CLKSOURCE_CONFIG(__CLKSOURCE__) \
          (((__CLKSOURCE__) >> CONFIG_SHIFT) & 0xFFUL)

#define LL_CLKSOURCE_REG(__CLKSOURCE__) \
          (((__CLKSOURCE__) >> REG_SHIFT   ) & 0xFFFUL)

#define LL_CLKSOURCE(__REG__, __MSK__, __CLK__)      \
          ((uint32_t)((((__REG__) ) << REG_SHIFT)  | \
          (( __MSK__              ) << MASK_SHIFT) | \
          (( __CLK__              ) << CONFIG_SHIFT)))

/**
  * @}
  */
#endif /*USE_FULL_LL_DRIVER*/

/* Exported types ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RCC_LL_Exported_Types RCC Exported Types
  * @{
  */

/** @defgroup LL_ES_CLOCK_FREQ Clocks Frequency Structure
  * @{
  */

/**
  * @brief  RCC Clocks Frequency Structure
  */
typedef struct
{
  uint32_t MPUSS_Frequency;   /*!< MPUSS clock frequency */
  uint32_t AXISS_Frequency;   /*!< AXISS clock frequency */
  uint32_t MCUSS_Frequency;   /*!< MCUSS clock frequency */
  uint32_t ACLK_Frequency;    /*!< ACLK clock frequency */
  uint32_t HCLK1_Frequency;   /*!< HCLK1 clock frequency */
  uint32_t HCLK2_Frequency;   /*!< HCLK2 clock frequency */
  uint32_t HCLK3_Frequency;   /*!< HCLK3 clock frequency */
  uint32_t HCLK4_Frequency;   /*!< HCLK4 clock frequency */
  uint32_t HCLK5_Frequency;   /*!< HCLK5 clock frequency */
  uint32_t HCLK6_Frequency;   /*!< HCLK6 clock frequency */
  uint32_t MCU_Frequency;     /*!< MCU clock frequency */
  uint32_t MLHCLK_Frequency;  /*!< MLHCLK clock frequency */
  uint32_t PCLK1_Frequency;   /*!< PCLK1 clock frequency */
  uint32_t PCLK2_Frequency;   /*!< PCLK2 clock frequency */
  uint32_t PCLK3_Frequency;   /*!< PCLK3 clock frequency */
  uint32_t PCLK4_Frequency;   /*!< PCLK4 clock frequency */
  uint32_t PCLK5_Frequency;   /*!< PCLK5 clock frequency */
} LL_RCC_ClocksTypeDef;

/**
  * @}
  */

/**
  * @brief  PLL Clocks Frequency Structure
  */
typedef struct
{
  uint32_t PLL_P_Frequency;
  uint32_t PLL_Q_Frequency;
  uint32_t PLL_R_Frequency;
} LL_PLL_ClocksTypeDef;

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCC_LL_Exported_Constants RCC Exported Constants
  * @{
  */

/** @defgroup RCC_LL_EC_OSC_VALUES Oscillator Values adaptation
  * @brief    Defines used to adapt values of different oscillators
  * @note     These values could be modified in the user environment according to
  *           HW set-up.
  * @{
  */
#if !defined  (HSE_VALUE)
#define HSE_VALUE    24000000U   /*!< Value of the HSE oscillator in Hz */
#endif /* HSE_VALUE */

#if !defined  (HSI_VALUE)
#define HSI_VALUE    64000000U  /*!< Value of the HSI oscillator in Hz */
#endif /* HSI_VALUE */

#if !defined  (LSE_VALUE)
#define LSE_VALUE    32768U     /*!< Value of the LSE oscillator in Hz */
#endif /* LSE_VALUE */

