zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_ll_rcc.h
#if !defined  (LSI_VALUE)
#define LSI_VALUE    32000U     /*!< Value of the LSI oscillator in Hz */
#endif /* LSI_VALUE */

#if !defined  (CSI_VALUE)
#define CSI_VALUE    4000000U     /*!< Value of the CSI oscillator in Hz */
#endif /* LSI_VALUE */

#if !defined  (EXTERNAL_CLOCK_VALUE)
#define EXTERNAL_CLOCK_VALUE    12288000U /*!< Value of the I2S_CKIN external oscillator in Hz */
#endif /* EXTERNAL_CLOCK_VALUE */

#if !defined  (USBO_48M_VALUE)
#define USBO_48M_VALUE    48000000U /*!< Value of the rcc_ck_usbo_48m oscillator in Hz */
#endif /* USBO_48M_VALUE */

/**
  * @}
  */

/** @defgroup RCC_LL_EC_CLEAR_FLAG Clear Flags Defines
  * @brief    Flags defines which can be used with LL_RCC_WriteReg function
  * @{
  */
#define LL_RCC_CIFR_LSIRDYC      RCC_MC_CIFR_LSIRDYF /*!< LSI Ready Interrupt Clear */
#define LL_RCC_CIFR_LSERDYC      RCC_MC_CIFR_LSERDYF /*!< LSE Ready Interrupt Clear */
#define LL_RCC_CIFR_HSIRDYC      RCC_MC_CIFR_HSIRDYF /*!< HSI Ready Interrupt Clear */
#define LL_RCC_CIFR_HSERDYC      RCC_MC_CIFR_HSERDYF /*!< HSE Ready Interrupt Clear */
#define LL_RCC_CIFR_CSIRDYC      RCC_MC_CIFR_CSIRDYF /*!< CSI Ready Interrupt Clear */
#define LL_RCC_CIFR_PLL1RDYC     RCC_MC_CIFR_PLL1DYF /*!< PLL1 Ready Interrupt Clear */
#define LL_RCC_CIFR_PLL2RDYC     RCC_MC_CIFR_PLL2DYF /*!< PLL2 Ready Interrupt Clear */
#define LL_RCC_CIFR_PLL3RDYC     RCC_MC_CIFR_PLL3DYF /*!< PLL3 Ready Interrupt Clear */
#define LL_RCC_CIFR_PLL4RDYC     RCC_MC_CIFR_PLL4DYF /*!< PLL4 Ready Interrupt Clear */
#define LL_RCC_CIFR_LSECSSC      RCC_MC_CIFR_LSECSSF /*!< LSE Clock Security System Interrupt Clear */
#define LL_RCC_CIFR_WKUPC        RCC_MC_CIFR_WKUPF   /*!< Wake up from CStop Interrupt Clear */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with LL_RCC_ReadReg function
  * @{
  */
#define LL_RCC_CIFR_LSIRDYF      RCC_MC_CIFR_LSIRDYF /*!< LSI Ready Interrupt flag */
#define LL_RCC_CIFR_LSERDYF      RCC_MC_CIFR_LSERDYF /*!< LSE Ready Interrupt flag */
#define LL_RCC_CIFR_HSIRDYF      RCC_MC_CIFR_HSIRDYF /*!< HSI Ready Interrupt flag */
#define LL_RCC_CIFR_HSERDYF      RCC_MC_CIFR_HSERDYF /*!< HSE Ready Interrupt flag */
#define LL_RCC_CIFR_CSIRDYF      RCC_MC_CIFR_CSIRDYF /*!< CSI Ready Interrupt flag */
#define LL_RCC_CIFR_PLL1RDYF     RCC_MC_CIFR_PLL1DYF /*!< PLL1 Ready Interrupt flag */
#define LL_RCC_CIFR_PLL2RDYF     RCC_MC_CIFR_PLL2DYF /*!< PLL2 Ready Interrupt flag */
#define LL_RCC_CIFR_PLL3RDYF     RCC_MC_CIFR_PLL3DYF /*!< PLL3 Ready Interrupt flag */
#define LL_RCC_CIFR_PLL4RDYF     RCC_MC_CIFR_PLL4DYF /*!< PLL4 Ready Interrupt flag */
#define LL_RCC_CIFR_LSECSSF      RCC_MC_CIFR_LSECSSF /*!< LSE Clock Security System Interrupt flag */
#define LL_RCC_CIFR_WKUPF        RCC_MC_CIFR_WKUPF   /*!< Wake up from CStop Interrupt flag */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_IT IT Defines
  * @brief    IT defines which can be used with LL_RCC_ReadReg and  LL_RCC_WriteReg functions
  * @{
  */
#define LL_RCC_CIER_LSIRDYIE      RCC_MC_CIER_LSIRDYIE /*!< LSI Ready Interrupt Enable */
#define LL_RCC_CIER_LSERDYIE      RCC_MC_CIER_LSERDYIE /*!< LSE Ready Interrupt Enable */
#define LL_RCC_CIER_HSIRDYIE      RCC_MC_CIER_HSIRDYIE /*!< HSI Ready Interrupt Enable */
#define LL_RCC_CIER_HSERDYIE      RCC_MC_CIER_HSERDYIE /*!< HSE Ready Interrupt Enable */
#define LL_RCC_CIER_CSIRDYIE      RCC_MC_CIER_CSIRDYIE /*!< CSI Ready Interrupt Enable */
#define LL_RCC_CIER_PLL1RDYIE     RCC_MC_CIER_PLL1DYIE /*!< PLL1 Ready Interrupt Enable */
#define LL_RCC_CIER_PLL2RDYIE     RCC_MC_CIER_PLL2DYIE /*!< PLL2 Ready Interrupt Enable */
#define LL_RCC_CIER_PLL3RDYIE     RCC_MC_CIER_PLL3DYIE /*!< PLL3 Ready Interrupt Enable */
#define LL_RCC_CIER_PLL4RDYIE     RCC_MC_CIER_PLL4DYIE /*!< PLL4 Ready Interrupt Enable */
#define LL_RCC_CIER_LSECSSIE      RCC_MC_CIER_LSECSSIE /*!< LSE Clock Security System Interrupt Enable */
#define LL_RCC_CIER_WKUPIE        RCC_MC_CIER_WKUPIE   /*!< Wake up from CStop Interrupt Enable */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_HSIDIV  HSI oscillator divider
  * @{
  */
#define LL_RCC_HSI_DIV_1                   RCC_HSICFGR_HSIDIV_0
#define LL_RCC_HSI_DIV_2                   RCC_HSICFGR_HSIDIV_1
#define LL_RCC_HSI_DIV_4                   RCC_HSICFGR_HSIDIV_2
#define LL_RCC_HSI_DIV_8                   RCC_HSICFGR_HSIDIV_3
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MCOxSOURCE  MCO SOURCE selection
  * @{
  */
#define LL_RCC_MCO1SOURCE_HSI      LL_CLKSOURCE(RCC_OFFSET_MCO1CFGR, RCC_MCO1CFGR_MCO1SEL, RCC_MCO1CFGR_MCO1SEL_0)
#define LL_RCC_MCO1SOURCE_HSE      LL_CLKSOURCE(RCC_OFFSET_MCO1CFGR, RCC_MCO1CFGR_MCO1SEL, RCC_MCO1CFGR_MCO1SEL_1)
#define LL_RCC_MCO1SOURCE_CSI      LL_CLKSOURCE(RCC_OFFSET_MCO1CFGR, RCC_MCO1CFGR_MCO1SEL, RCC_MCO1CFGR_MCO1SEL_2)
#define LL_RCC_MCO1SOURCE_LSI      LL_CLKSOURCE(RCC_OFFSET_MCO1CFGR, RCC_MCO1CFGR_MCO1SEL, RCC_MCO1CFGR_MCO1SEL_3)
#define LL_RCC_MCO1SOURCE_LSE      LL_CLKSOURCE(RCC_OFFSET_MCO1CFGR, RCC_MCO1CFGR_MCO1SEL, RCC_MCO1CFGR_MCO1SEL_4)

#define LL_RCC_MCO2SOURCE_MPU      LL_CLKSOURCE(RCC_OFFSET_MCO2CFGR, RCC_MCO2CFGR_MCO2SEL, RCC_MCO2CFGR_MCO2SEL_0)
#define LL_RCC_MCO2SOURCE_AXI      LL_CLKSOURCE(RCC_OFFSET_MCO2CFGR, RCC_MCO2CFGR_MCO2SEL, RCC_MCO2CFGR_MCO2SEL_1)
#define LL_RCC_MCO2SOURCE_MCU      LL_CLKSOURCE(RCC_OFFSET_MCO2CFGR, RCC_MCO2CFGR_MCO2SEL, RCC_MCO2CFGR_MCO2SEL_2)
#define LL_RCC_MCO2SOURCE_PLL4     LL_CLKSOURCE(RCC_OFFSET_MCO2CFGR, RCC_MCO2CFGR_MCO2SEL, RCC_MCO2CFGR_MCO2SEL_3)
#define LL_RCC_MCO2SOURCE_HSE      LL_CLKSOURCE(RCC_OFFSET_MCO2CFGR, RCC_MCO2CFGR_MCO2SEL, RCC_MCO2CFGR_MCO2SEL_4)
#define LL_RCC_MCO2SOURCE_HSI      LL_CLKSOURCE(RCC_OFFSET_MCO2CFGR, RCC_MCO2CFGR_MCO2SEL, RCC_MCO2CFGR_MCO2SEL_5)
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MCO1_DIV  MCO1 prescaler
  * @{
  */
#define LL_RCC_MCO1_DIV_1                  RCC_MCO1CFGR_MCO1DIV_0   /*!< MCO not divided */
#define LL_RCC_MCO1_DIV_2                  RCC_MCO1CFGR_MCO1DIV_1   /*!< MCO divided by 2 */
#define LL_RCC_MCO1_DIV_3                  RCC_MCO1CFGR_MCO1DIV_2   /*!< MCO divided by 3 */
#define LL_RCC_MCO1_DIV_4                  RCC_MCO1CFGR_MCO1DIV_3   /*!< MCO divided by 4 */
#define LL_RCC_MCO1_DIV_5                  RCC_MCO1CFGR_MCO1DIV_4   /*!< MCO divided by 5 */
#define LL_RCC_MCO1_DIV_6                  RCC_MCO1CFGR_MCO1DIV_5   /*!< MCO divided by 6 */
#define LL_RCC_MCO1_DIV_7                  RCC_MCO1CFGR_MCO1DIV_6   /*!< MCO divided by 7 */
#define LL_RCC_MCO1_DIV_8                  RCC_MCO1CFGR_MCO1DIV_7   /*!< MCO divided by 8 */
#define LL_RCC_MCO1_DIV_9                  RCC_MCO1CFGR_MCO1DIV_8   /*!< MCO divided by 9 */
#define LL_RCC_MCO1_DIV_10                 RCC_MCO1CFGR_MCO1DIV_9   /*!< MCO divided by 10 */
#define LL_RCC_MCO1_DIV_11                 RCC_MCO1CFGR_MCO1DIV_10  /*!< MCO divided by 11 */
#define LL_RCC_MCO1_DIV_12                 RCC_MCO1CFGR_MCO1DIV_11  /*!< MCO divided by 12 */
#define LL_RCC_MCO1_DIV_13                 RCC_MCO1CFGR_MCO1DIV_12  /*!< MCO divided by 13 */
#define LL_RCC_MCO1_DIV_14                 RCC_MCO1CFGR_MCO1DIV_13  /*!< MCO divided by 14 */
#define LL_RCC_MCO1_DIV_15                 RCC_MCO1CFGR_MCO1DIV_14  /*!< MCO divided by 15 */
#define LL_RCC_MCO1_DIV_16                 RCC_MCO1CFGR_MCO1DIV_15  /*!< MCO divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MCO2_DIV  MCO2 prescaler
  * @{
  */
#define LL_RCC_MCO2_DIV_1                  RCC_MCO2CFGR_MCO2DIV_0   /*!< MCO not divided */
#define LL_RCC_MCO2_DIV_2                  RCC_MCO2CFGR_MCO2DIV_1   /*!< MCO divided by 2 */
#define LL_RCC_MCO2_DIV_3                  RCC_MCO2CFGR_MCO2DIV_2   /*!< MCO divided by 3 */
#define LL_RCC_MCO2_DIV_4                  RCC_MCO2CFGR_MCO2DIV_3   /*!< MCO divided by 4 */
#define LL_RCC_MCO2_DIV_5                  RCC_MCO2CFGR_MCO2DIV_4   /*!< MCO divided by 5 */
#define LL_RCC_MCO2_DIV_6                  RCC_MCO2CFGR_MCO2DIV_5   /*!< MCO divided by 6 */
#define LL_RCC_MCO2_DIV_7                  RCC_MCO2CFGR_MCO2DIV_6   /*!< MCO divided by 7 */
#define LL_RCC_MCO2_DIV_8                  RCC_MCO2CFGR_MCO2DIV_7   /*!< MCO divided by 8 */
#define LL_RCC_MCO2_DIV_9                  RCC_MCO2CFGR_MCO2DIV_8   /*!< MCO divided by 9 */
#define LL_RCC_MCO2_DIV_10                 RCC_MCO2CFGR_MCO2DIV_9   /*!< MCO divided by 10 */
#define LL_RCC_MCO2_DIV_11                 RCC_MCO2CFGR_MCO2DIV_10  /*!< MCO divided by 11 */
#define LL_RCC_MCO2_DIV_12                 RCC_MCO2CFGR_MCO2DIV_11  /*!< MCO divided by 12 */
#define LL_RCC_MCO2_DIV_13                 RCC_MCO2CFGR_MCO2DIV_12  /*!< MCO divided by 13 */
#define LL_RCC_MCO2_DIV_14                 RCC_MCO2CFGR_MCO2DIV_13  /*!< MCO divided by 14 */
#define LL_RCC_MCO2_DIV_15                 RCC_MCO2CFGR_MCO2DIV_14  /*!< MCO divided by 15 */
#define LL_RCC_MCO2_DIV_16                 RCC_MCO2CFGR_MCO2DIV_15  /*!< MCO divided by 16 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_RTC_HSEDIV  HSE prescaler for RTC clock
  * @{
  */
#define LL_RCC_RTC_HSE_DIV_1                RCC_RTCDIVR_RTCDIV_1
#define LL_RCC_RTC_HSE_DIV_2                RCC_RTCDIVR_RTCDIV_2
#define LL_RCC_RTC_HSE_DIV_3                RCC_RTCDIVR_RTCDIV_3
#define LL_RCC_RTC_HSE_DIV_4                RCC_RTCDIVR_RTCDIV_4
#define LL_RCC_RTC_HSE_DIV_5                RCC_RTCDIVR_RTCDIV_5
#define LL_RCC_RTC_HSE_DIV_6                RCC_RTCDIVR_RTCDIV_6
#define LL_RCC_RTC_HSE_DIV_7                RCC_RTCDIVR_RTCDIV_7
#define LL_RCC_RTC_HSE_DIV_8                RCC_RTCDIVR_RTCDIV_8
#define LL_RCC_RTC_HSE_DIV_9                RCC_RTCDIVR_RTCDIV_9
#define LL_RCC_RTC_HSE_DIV_10               RCC_RTCDIVR_RTCDIV_10
#define LL_RCC_RTC_HSE_DIV_11               RCC_RTCDIVR_RTCDIV_11
#define LL_RCC_RTC_HSE_DIV_12               RCC_RTCDIVR_RTCDIV_12
#define LL_RCC_RTC_HSE_DIV_13               RCC_RTCDIVR_RTCDIV_13
#define LL_RCC_RTC_HSE_DIV_14               RCC_RTCDIVR_RTCDIV_14
#define LL_RCC_RTC_HSE_DIV_15               RCC_RTCDIVR_RTCDIV_15
#define LL_RCC_RTC_HSE_DIV_16               RCC_RTCDIVR_RTCDIV_16
#define LL_RCC_RTC_HSE_DIV_17               RCC_RTCDIVR_RTCDIV_17
#define LL_RCC_RTC_HSE_DIV_18               RCC_RTCDIVR_RTCDIV_18
#define LL_RCC_RTC_HSE_DIV_19               RCC_RTCDIVR_RTCDIV_19
#define LL_RCC_RTC_HSE_DIV_20               RCC_RTCDIVR_RTCDIV_20
#define LL_RCC_RTC_HSE_DIV_21               RCC_RTCDIVR_RTCDIV_21
#define LL_RCC_RTC_HSE_DIV_22               RCC_RTCDIVR_RTCDIV_22
#define LL_RCC_RTC_HSE_DIV_23               RCC_RTCDIVR_RTCDIV_23
#define LL_RCC_RTC_HSE_DIV_24               RCC_RTCDIVR_RTCDIV_24
#define LL_RCC_RTC_HSE_DIV_25               RCC_RTCDIVR_RTCDIV_25
#define LL_RCC_RTC_HSE_DIV_26               RCC_RTCDIVR_RTCDIV_26
#define LL_RCC_RTC_HSE_DIV_27               RCC_RTCDIVR_RTCDIV_27
#define LL_RCC_RTC_HSE_DIV_28               RCC_RTCDIVR_RTCDIV_28
#define LL_RCC_RTC_HSE_DIV_29               RCC_RTCDIVR_RTCDIV_29
#define LL_RCC_RTC_HSE_DIV_30               RCC_RTCDIVR_RTCDIV_30
#define LL_RCC_RTC_HSE_DIV_31               RCC_RTCDIVR_RTCDIV_31
#define LL_RCC_RTC_HSE_DIV_32               RCC_RTCDIVR_RTCDIV_32
#define LL_RCC_RTC_HSE_DIV_33               RCC_RTCDIVR_RTCDIV_33
#define LL_RCC_RTC_HSE_DIV_34               RCC_RTCDIVR_RTCDIV_34
#define LL_RCC_RTC_HSE_DIV_35               RCC_RTCDIVR_RTCDIV_35
#define LL_RCC_RTC_HSE_DIV_36               RCC_RTCDIVR_RTCDIV_36
#define LL_RCC_RTC_HSE_DIV_37               RCC_RTCDIVR_RTCDIV_37
#define LL_RCC_RTC_HSE_DIV_38               RCC_RTCDIVR_RTCDIV_38
#define LL_RCC_RTC_HSE_DIV_39               RCC_RTCDIVR_RTCDIV_39
#define LL_RCC_RTC_HSE_DIV_40               RCC_RTCDIVR_RTCDIV_40
#define LL_RCC_RTC_HSE_DIV_41               RCC_RTCDIVR_RTCDIV_41
#define LL_RCC_RTC_HSE_DIV_42               RCC_RTCDIVR_RTCDIV_42
#define LL_RCC_RTC_HSE_DIV_43               RCC_RTCDIVR_RTCDIV_43
#define LL_RCC_RTC_HSE_DIV_44               RCC_RTCDIVR_RTCDIV_44
#define LL_RCC_RTC_HSE_DIV_45               RCC_RTCDIVR_RTCDIV_45
#define LL_RCC_RTC_HSE_DIV_46               RCC_RTCDIVR_RTCDIV_46
#define LL_RCC_RTC_HSE_DIV_47               RCC_RTCDIVR_RTCDIV_47
#define LL_RCC_RTC_HSE_DIV_48               RCC_RTCDIVR_RTCDIV_48
#define LL_RCC_RTC_HSE_DIV_49               RCC_RTCDIVR_RTCDIV_49
#define LL_RCC_RTC_HSE_DIV_50               RCC_RTCDIVR_RTCDIV_50
#define LL_RCC_RTC_HSE_DIV_51               RCC_RTCDIVR_RTCDIV_51
#define LL_RCC_RTC_HSE_DIV_52               RCC_RTCDIVR_RTCDIV_52
#define LL_RCC_RTC_HSE_DIV_53               RCC_RTCDIVR_RTCDIV_53
#define LL_RCC_RTC_HSE_DIV_54               RCC_RTCDIVR_RTCDIV_54
#define LL_RCC_RTC_HSE_DIV_55               RCC_RTCDIVR_RTCDIV_55
#define LL_RCC_RTC_HSE_DIV_56               RCC_RTCDIVR_RTCDIV_56
#define LL_RCC_RTC_HSE_DIV_57               RCC_RTCDIVR_RTCDIV_57
#define LL_RCC_RTC_HSE_DIV_58               RCC_RTCDIVR_RTCDIV_58
#define LL_RCC_RTC_HSE_DIV_59               RCC_RTCDIVR_RTCDIV_59
#define LL_RCC_RTC_HSE_DIV_60               RCC_RTCDIVR_RTCDIV_60
#define LL_RCC_RTC_HSE_DIV_61               RCC_RTCDIVR_RTCDIV_61
#define LL_RCC_RTC_HSE_DIV_62               RCC_RTCDIVR_RTCDIV_62
#define LL_RCC_RTC_HSE_DIV_63               RCC_RTCDIVR_RTCDIV_63
#define LL_RCC_RTC_HSE_DIV_64               RCC_RTCDIVR_RTCDIV_64
/**
  * @}
  */

