zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_ll_rcc.h
/**
  * @brief  Set the oscillator used as PLL4 clock source.
  * @note   PLLSRC can be written only when all PLL4 is disabled.
  * @rmtoll RCK4SELR      PLL4SRC        LL_RCC_PLL4_SetSource
  * @param  PLLSource parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL4SOURCE_HSI
  *         @arg @ref LL_RCC_PLL4SOURCE_HSE
  *         @arg @ref LL_RCC_PLL4SOURCE_CSI
  *         @arg @ref LL_RCC_PLL4SOURCE_I2SCKIN
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_SetSource(uint32_t PLLSource)
{
  MODIFY_REG(RCC->RCK4SELR, RCC_RCK4SELR_PLL4SRC, PLLSource);
}

/**
  * @brief  Get the oscillator used as PLL4 clock source.
  * @rmtoll RCK4SELR      PLL4SRC        LL_RCC_PLL4_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PLL4SOURCE_HSI
  *         @arg @ref LL_RCC_PLL4SOURCE_HSE
  *         @arg @ref LL_RCC_PLL4SOURCE_CSI
  *         @arg @ref LL_RCC_PLL4SOURCE_I2SCKIN
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->RCK4SELR, RCC_RCK4SELR_PLL4SRC));
}

/**
  * @brief  Enable PLL4
  * @rmtoll PLL4CR           PLLON         LL_RCC_PLL4_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_Enable(void)
{
  SET_BIT(RCC->PLL4CR, RCC_PLL4CR_PLLON);
}

/**
  * @brief  Disable PLL4
  * @note Cannot be disabled if the PLL clock is used as a system clock.
  *       This API shall be called only when PLL1 DIVPEN, DIVQEN and DIVREN
  *       are disabled.
  * @rmtoll PLL4CR           PLLON         LL_RCC_PLL4_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_Disable(void)
{
  CLEAR_BIT(RCC->PLL4CR, RCC_PLL4CR_PLLON);
}

/**
  * @brief  Check if PLL4 Ready
  * @rmtoll PLL4CR           PLL4RDY        LL_RCC_PLL4_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_IsReady(void)
{
  return ((READ_BIT(RCC->PLL4CR, RCC_PLL4CR_PLL4RDY) == RCC_PLL4CR_PLL4RDY) ? 1UL : 0UL);
}

/**
  * @brief  Enable PLL4P
  * @note   This API shall be called only when PLL4 is enabled and ready.
  * @rmtoll PLL4CR           DIVPEN         LL_RCC_PLL4P_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4P_Enable(void)
{
  SET_BIT(RCC->PLL4CR, RCC_PLL4CR_DIVPEN);
}

/**
  * @brief  Enable PLL4Q
  * @note   This API shall be called only when PLL4 is enabled and ready.
  * @rmtoll PLL4CR           DIVQEN         LL_RCC_PLL4Q_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4Q_Enable(void)
{
  SET_BIT(RCC->PLL4CR, RCC_PLL4CR_DIVQEN);
}

/**
  * @brief  Enable PLL4R
  * @note   This API shall be called only when PLL4 is enabled and ready.
  * @rmtoll PLL4CR           DIVREN         LL_RCC_PLL4R_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4R_Enable(void)
{
  SET_BIT(RCC->PLL4CR, RCC_PLL4CR_DIVREN);
}

/**
  * @brief  Enable PLL4 FRACV
  * @rmtoll PLL4FRACR           FRACLE         LL_RCC_PLL4FRACV_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4FRACV_Enable(void)
{
  SET_BIT(RCC->PLL4FRACR, RCC_PLL4FRACR_FRACLE);
}

/**
  * @brief  Enable PLL4 Clock Spreading Generator
  * @rmtoll PLL4CR           SSCG_CTRL         LL_RCC_PLL4CSG_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4CSG_Enable(void)
{
  SET_BIT(RCC->PLL4CR, RCC_PLL4CR_SSCG_CTRL);
}

/**
  * @brief  Check if PLL4 P is enabled
  * @rmtoll PLL4CR           DIVPEN         LL_RCC_PLL4P_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4P_IsEnabled(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL4CR, RCC_PLL4CR_DIVPEN) == RCC_PLL4CR_DIVPEN) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL4 Q is enabled
  * @rmtoll PLL4CR           DIVQEN         LL_RCC_PLL4Q_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4Q_IsEnabled(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL4CR, RCC_PLL4CR_DIVQEN) == RCC_PLL4CR_DIVQEN) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL4 R is enabled
  * @rmtoll PLL4CR           DIVREN         LL_RCC_PLL4R_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4R_IsEnabled(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL4CR, RCC_PLL4CR_DIVREN) == RCC_PLL4CR_DIVREN) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL4 FRACV is enabled
  * @rmtoll PLL4FRACR           FRACLE         LL_RCC_PLL4FRACV_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4FRACV_IsEnabled(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL4FRACR, RCC_PLL4FRACR_FRACLE) == RCC_PLL4FRACR_FRACLE) ? 1UL : 0UL);
}

/**
  * @brief  Check if PLL4 Clock Spreading Generator is enabled
  * @rmtoll PLL4CR           SSCG_CTRL         LL_RCC_PLL4CSG_IsEnabled
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4CSG_IsEnabled(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL4CR, RCC_PLL4CR_SSCG_CTRL) == RCC_PLL4CR_SSCG_CTRL) ? 1UL : 0UL);
}

/**
  * @brief  Disable PLL4P
  * @rmtoll PLL4CR           DIVPEN         LL_RCC_PLL4P_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4P_Disable(void)
{
  CLEAR_BIT(RCC->PLL4CR, RCC_PLL4CR_DIVPEN);
}

/**
  * @brief  Disable PLL4Q
  * @rmtoll PLL4CR           DIVQEN         LL_RCC_PLL4Q_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4Q_Disable(void)
{
  CLEAR_BIT(RCC->PLL4CR, RCC_PLL4CR_DIVQEN);
}

/**
  * @brief  Disable PLL4R
  * @rmtoll PLL4CR           DIVREN         LL_RCC_PLL4R_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4R_Disable(void)
{
  CLEAR_BIT(RCC->PLL4CR, RCC_PLL4CR_DIVREN);
}

/**
  * @brief  Disable PLL4 FRACV
  * @rmtoll PLL4FRACR           FRACLE         LL_RCC_PLL4FRACV_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4FRACV_Disable(void)
{
  CLEAR_BIT(RCC->PLL4FRACR, RCC_PLL4FRACR_FRACLE);
}

/**
  * @brief  Disable PLL4 Clock Spreading Generator
  * @rmtoll PLL4CR           SSCG_CTRL         LL_RCC_PLL4CSG_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4CSG_Disable(void)
{
  CLEAR_BIT(RCC->PLL4CR, RCC_PLL4CR_SSCG_CTRL);
}

/**
  * @brief  Get PLL4 N Coefficient
  * @rmtoll PLL4CFGR1        DIVN          LL_RCC_PLL4_GetN
  * @retval A value between 4 and 512
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_GetN(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL4CFGR1, RCC_PLL4CFGR1_DIVN) >>  RCC_PLL4CFGR1_DIVN_Pos) + 1U);
}

/**
  * @brief  Get PLL4 M Coefficient
  * @rmtoll PLL4CFGR1       DIVM4          LL_RCC_PLL4_GetM
  * @retval A value between 1 and 64
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_GetM(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL4CFGR1, RCC_PLL4CFGR1_DIVM4) >>  RCC_PLL4CFGR1_DIVM4_Pos) + 1U);
}

/**
  * @brief  Get PLL4 input frequency range
  * @rmtoll PLL4CFGR1       IFRGE          LL_RCC_PLL4_GetIFRGE
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_PLL4IFRANGE_0
  *         @arg @ref LL_RCC_PLL4IFRANGE_1
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_GetIFRGE(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL4CFGR1, RCC_PLL4CFGR1_IFRGE));
}

/**
  * @brief  Get PLL4 P Coefficient
  * @rmtoll PLL4CFGR2        DIVP          LL_RCC_PLL4_GetP
  * @retval A value between 1 and 128
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_GetP(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL4CFGR2, RCC_PLL4CFGR2_DIVP) >>  RCC_PLL4CFGR2_DIVP_Pos) + 1U);
}

/**
  * @brief  Get PLL4 Q Coefficient
  * @rmtoll PLL4CFGR2        DIVQ          LL_RCC_PLL4_GetQ
  * @retval A value between 1 and 128
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_GetQ(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL4CFGR2, RCC_PLL4CFGR2_DIVQ) >>  RCC_PLL4CFGR2_DIVQ_Pos) + 1U);
}

/**
  * @brief  Get PLL4 R Coefficient
  * @rmtoll PLL4CFGR2        DIVR          LL_RCC_PLL4_GetR
  * @retval A value between 1 and 128
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_GetR(void)
{
  return (uint32_t)((READ_BIT(RCC->PLL4CFGR2, RCC_PLL4CFGR2_DIVR) >>  RCC_PLL4CFGR2_DIVR_Pos) + 1U);
}

/**
  * @brief  Get PLL4 FRACV Coefficient
  * @rmtoll PLL4FRACR      FRACV          LL_RCC_PLL4_GetFRACV
  * @retval A value between 0 and 8191 (0x1FFF)
  */
__STATIC_INLINE uint32_t LL_RCC_PLL4_GetFRACV(void)
{
  return (uint32_t)(READ_BIT(RCC->PLL4FRACR, RCC_PLL4FRACR_FRACV) >>  RCC_PLL4FRACR_FRACV_Pos);
}

/**
  * @brief  Set PLL4 N Coefficient
  * @note   This API shall be called only when PLL4 is disabled.
  * @rmtoll PLL4CFGR1        DIVN          LL_RCC_PLL4_SetN
  * @param  DIVN parameter can be a value between 4 and 512
  */
__STATIC_INLINE void LL_RCC_PLL4_SetN(uint32_t DIVN)
{
  MODIFY_REG(RCC->PLL4CFGR1, RCC_PLL4CFGR1_DIVN, (DIVN - 1U) << RCC_PLL4CFGR1_DIVN_Pos);
}

/**
  * @brief  Set PLL4 M Coefficient
  * @note   This API shall be called only when PLL4 is disabled.
  * @rmtoll PLL4CFGR1       DIVM4          LL_RCC_PLL4_SetM
  * @param  DIVM4 parameter can be a value between 1 and 64
  */
__STATIC_INLINE void LL_RCC_PLL4_SetM(uint32_t DIVM4)
{
  MODIFY_REG(RCC->PLL4CFGR1, RCC_PLL4CFGR1_DIVM4, (DIVM4 - 1U) << RCC_PLL4CFGR1_DIVM4_Pos);
}

/**
  * @brief  Set PLL4 input frequency range
  * @rmtoll PLL4CFGR1       IFRGE          LL_RCC_PLL4_SetIFRGE
  * @param  IFRange parameter can be one of the following values:
  *         @arg @ref LL_RCC_PLL4IFRANGE_0
  *         @arg @ref LL_RCC_PLL4IFRANGE_1
  * @note   If ref4_ck is equal to 8 MHz, it is recommended to set LL_RCC_PLL4IFRANGE_1
  * @retval None
  */
__STATIC_INLINE void LL_RCC_PLL4_SetIFRGE(uint32_t IFRange)
{
  MODIFY_REG(RCC->PLL4CFGR1, RCC_PLL4CFGR1_IFRGE, IFRange);
}

/**
  * @brief  Set PLL4 P Coefficient
  * @rmtoll PLL4CFGR2        DIVP          LL_RCC_PLL4_SetP
  * @param  DIVP parameter can be a value between 1 and 128
  */
__STATIC_INLINE void LL_RCC_PLL4_SetP(uint32_t DIVP)
{
  MODIFY_REG(RCC->PLL4CFGR2, RCC_PLL4CFGR2_DIVP, (DIVP - 1U) << RCC_PLL4CFGR2_DIVP_Pos);
}

/**
  * @brief  Set PLL4 Q Coefficient
  * @rmtoll PLL4CFGR2        DIVQ          LL_RCC_PLL4_SetQ
  * @param  DIVQ parameter can be a value between 1 and 128
  */
__STATIC_INLINE void LL_RCC_PLL4_SetQ(uint32_t DIVQ)
{
  MODIFY_REG(RCC->PLL4CFGR2, RCC_PLL4CFGR2_DIVQ, (DIVQ - 1U) << RCC_PLL4CFGR2_DIVQ_Pos);
}

/**
  * @brief  Set PLL4 R Coefficient
  * @rmtoll PLL4CFGR2        DIVR          LL_RCC_PLL4_SetR
  * @param  DIVR parameter can be a value between 1 and 128
  */
__STATIC_INLINE void LL_RCC_PLL4_SetR(uint32_t DIVR)
{
  MODIFY_REG(RCC->PLL4CFGR2, RCC_PLL4CFGR2_DIVR, (DIVR - 1U) << RCC_PLL4CFGR2_DIVR_Pos);
}

/**
  * @brief  Set PLL4 FRACV Coefficient
  * @rmtoll PLL4FRACR        FRACV          LL_RCC_PLL4_SetFRACV
  * @param  FRACV parameter can be a value between 0 and 8191 (0x1FFF)
  */
__STATIC_INLINE void LL_RCC_PLL4_SetFRACV(uint32_t FRACV)
{
  MODIFY_REG(RCC->PLL4FRACR, RCC_PLL4FRACR_FRACV, FRACV << RCC_PLL4FRACR_FRACV_Pos);
}

